app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "sanjay"], ["last_name", "yuches"], ["created_at", "2018-11-27 21:43:38.880568"], ["updated_at", "2018-11-27 21:43:38.880568"]]
---
  def create
    @student = Student.create(params[:student])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "meshilem"], ["last_name", "luzy"], ["updated_at", "2018-11-27 22:09:41.058889"], ["id", 2]]
---
 def update
   @student = Student.find(params[:id])
   @student.update(params[:student])